/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Telesec Extension";
"06 06 02 82 06 01 0A 01"		= "Telesec Mechanism";

"06 07 02 82 06 01 0A 01 00"	= "Telesec Authentication";
"06 08 02 82 06 01 0A 01 00 01"	= "Password Authentication";
"06 08 02 82 06 01 0A 01 00 02" = "Protected Password Authentication";
"06 08 02 82 06 01 0A 01 00 03" = "One-Way X.509 Authentication";
"06 08 02 82 06 01 0A 01 00 04" = "Two-Way X.509 Authentication";
"06 08 02 82 06 01 0A 01 00 05" = "Three-Way X.509 Authentication";
"06 08 02 82 06 01 0A 01 00 06" = "One-Way ISO9798 Authentication";
"06 08 02 82 06 01 0A 01 00 07" = "Two-Way ISO9798 Authentication";
"06 08 02 82 06 01 0A 01 00 08" = "Telekom Authentication";

"06 07 02 82 06 01 0A 01 01"	= "Telesec Signature";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 with RSA and ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 with RSA and Telesec Signature Standard";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 with RSA and ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 with RSA and Telesec Signature Standard";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 with RSA and Telekom Signature Standard";
"06 08 02 82 06 01 0A 01 01 09"	= "HBCI RSA Signature";

"06 07 02 82 06 01 0A 01 02"	= "Telesec Encryption";
"06 08 02 82 06 01 0A 01 02 00"	= "none";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "One-Way Function";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash using Block Cipher";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "FEC Function";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Telesec Module";
"06 07 02 82 06 01 0A 02 00"	= "Algorithms";
"06 07 02 82 06 01 0A 02 01"	= "Attribute Types";
"06 07 02 82 06 01 0A 02 02"	= "Certificate Types";
"06 07 02 82 06 01 0A 02 03"	= "Message Types";
"06 07 02 82 06 01 0A 02 04"	= "PL Protocol";
"06 07 02 82 06 01 0A 02 05"	= "SME and Components of SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Useful Definitions";
"06 07 02 82 06 01 0A 02 08"	= "STE Files";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Electronic Order";
"06 07 02 82 06 01 0A 02 0B"	= "Telesec TTP Asymmetric Application";
"06 07 02 82 06 01 0A 02 0C"	= "Telesec TTP Basis Application";
"06 07 02 82 06 01 0A 02 0D"	= "Telesec TTP Messages";
"06 07 02 82 06 01 0A 02 0E"	= "Telesec TTP Time Stamp Application";

"06 06 02 82 06 01 0A 03"		= "Object Class";
"06 07 02 82 06 01 0A 03 00"	= "Telesec Other Name";
"06 07 02 82 06 01 0A 03 01"	= "Directory";
"06 07 02 82 06 01 0A 03 02"	= "Directory Type";
"06 07 02 82 06 01 0A 03 03"	= "Directory Group";
"06 07 02 82 06 01 0A 03 04"	= "Directory User";
"06 07 02 82 06 01 0A 03 05"	= "Symmetric Key Entry";

"06 06 02 82 06 01 0A 04"		= "Package";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Name Binding";
"06 06 02 82 06 01 0A 07"		= "Attribute";
"06 07 02 82 06 01 0A 07 00"	= "Application Group Identifier";
"06 07 02 82 06 01 0A 07 01"	= "Certificate Type";
"06 07 02 82 06 01 0A 07 02"	= "Telesec Certificate";
"06 07 02 82 06 01 0A 07 03"	= "Certificate Number";
"06 07 02 82 06 01 0A 07 04"	= "Certificate Revocation List";
"06 07 02 82 06 01 0A 07 05"	= "Creation Date";
"06 07 02 82 06 01 0A 07 06"	= "Issuer";
"06 07 02 82 06 01 0A 07 07"	= "Naming Authority";
"06 07 02 82 06 01 0A 07 08"	= "Public Key Directory";
"06 07 02 82 06 01 0A 07 09"	= "Security Domain";
"06 07 02 82 06 01 0A 07 0A"	= "Subject";
"06 07 02 82 06 01 0A 07 0B"	= "Time of Revocation";
"06 07 02 82 06 01 0A 07 0C"	= "User Group Reference";
"06 07 02 82 06 01 0A 07 0D"	= "Validity";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Security Message Environment";
"06 07 02 82 06 01 0A 07 10"	= "Anonymized Public Key Directory";
"06 07 02 82 06 01 0A 07 11"	= "Telesec Given Name";
"06 07 02 82 06 01 0A 07 12"	= "Name Additions";
"06 07 02 82 06 01 0A 07 13"	= "Telesec Postal Code";
"06 07 02 82 06 01 0A 07 14"	= "Name Distinguisher";
"06 07 02 82 06 01 0A 07 15"	= "Telesec Certificate List";
"06 07 02 82 06 01 0A 07 16"	= "Teletrust Certificate List";
"06 07 02 82 06 01 0A 07 17"	= "X.509 Certificate List";
"06 07 02 82 06 01 0A 07 18"	= "Time of Issue";
"06 07 02 82 06 01 0A 07 19"	= "Physical Card Number";
"06 07 02 82 06 01 0A 07 1A"	= "File Type";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl File is Archive";
"06 07 02 82 06 01 0A 07 1C"	= "Email Address";
"06 07 02 82 06 01 0A 07 1D"	= "Certificate Template List";
"06 07 02 82 06 01 0A 07 1E"	= "Directory Name";
"06 07 02 82 06 01 0A 07 1F"	= "Directory Type Name";
"06 07 02 82 06 01 0A 07 20"	= "Directory Group Name";
"06 07 02 82 06 01 0A 07 21"	= "Directory User Name";
"06 07 02 82 06 01 0A 07 22"	= "Revocation Flag";
"06 07 02 82 06 01 0A 07 23"	= "Symmetric Key Entry Name";
"06 07 02 82 06 01 0A 07 24"	= "GL Number";
"06 07 02 82 06 01 0A 07 25"	= "GO Number";
"06 07 02 82 06 01 0A 07 26"	= "G Key Data";
"06 07 02 82 06 01 0A 07 27"	= "Z Key Data";
"06 07 02 82 06 01 0A 07 28"	= "KT Key Data";
"06 07 02 82 06 01 0A 07 2A"	= "KT Key Number";
"06 07 02 82 06 01 0A 07 33"	= "Time of Revocation Generation";
"06 07 02 82 06 01 0A 07 34"	= "Liability Text";

"06 06 02 82 06 01 0A 08"		= "Attribute Group";
"06 06 02 82 06 01 0A 09"		= "Action";
"06 06 02 82 06 01 0A 0A"		= "Notification";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Security Application";

"06 06 02 82 06 01 0A 0C"		= "Cert and CRL Extension Definitions";

"06 07 02 82 06 01 0A 0C 00"	= "Cert Extension Liability Limitation Extension";
"06 07 02 82 06 01 0A 0C 01"	= "Telesec Certificate ID Extension";
"06 07 02 82 06 01 0A 0C 02"	= "Telesec Policy Identifier";
"06 07 02 82 06 01 0A 0C 03"	= "Telesec Policy Qualifier ID";
"06 07 02 82 06 01 0A 0C 04"	= "Telesec CRL Filtered Extension";
"06 07 02 82 06 01 0A 0C 05"	= "Telesec CRL Filter Extension";
"06 07 02 82 06 01 0A 0C 06"	= "Telesec Naming Authority Extension";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "User ID";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 Mailbox";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Domain Component";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Australian Business Number";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Certificates Australia Policy Identifier";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Signet Policy Identifier";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symmetric Encryption Algorithm";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "SEIS High-Assurance Policy Identifier";
"06 06 2A 85 70 22 01 02"	= "SEIS GAK Policy Identifier";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "SEIS AT Personal Identifier";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 Module";
"06 07 2A 86 48 CE 38 01 01"	= "X9F1 Certificate Management";
"06 06 2A 86 48 CE 38 02"		= "Hold Instruction";
"06 07 2A 86 48 CE 38 02 01"	= "Hold Instruction-None";
"06 07 2A 86 48 CE 38 02 02"	= "Call Issuer";
"06 07 2A 86 48 CE 38 02 03"	= "Reject";
"06 07 2A 86 48 CE 38 02 04"	= "Pickup Token";
"06 06 2A 86 48 CE 38 03"		= "Attribute";
"06 06 2A 86 48 CE 38 03 01"	= "Countersignature";
"06 06 2A 86 48 CE 38 03 02"	= "Attribute Certificate";
"06 06 2A 86 48 CE 38 04"		= "Algorithm";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA Match";
"06 07 2A 86 48 CE 38 04 03"	= "DSA with SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ANSI X9.62 Field Type";
"06 07 2A 86 48 CE 3D 01 01"	= "Prime Field";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinomial Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomial Basis";
"06 06 2A 86 48 CE 3D 02"		= "Public Key Type";
"06 07 2A 86 48 CE 3D 02 01"	= "Elliptic Curve Public Key";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ANSI X9.42 Field Type";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois Field Prime";
"06 06 2A 86 48 CE 3E 02"		= "Number Type";
"06 07 2A 86 48 CE 3E 02 01"	= "Diffie-Hellman Public Key";
"06 06 2A 86 48 CE 3E 03"		= "Scheme";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Static";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Entrust Version Info";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE with MD5 and CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "Password-Based MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Entrust User";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA Info";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Attribute Certificate";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 with RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 with RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 with RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 with RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP Encryption (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP Label Specified";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "RSA-PSS Signature Scheme";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 with RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 with RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 with RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 with RSA Encryption";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "BSAFE RSA Encryption";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Diffie-Hellman Key Agreement";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE with MD2 and DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE with MD5 and DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE with MD2 and RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE with MD5 and RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE with MD5 and XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE with SHA and DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Data";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Signed Data";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Enveloped Data";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Signed and Enveloped Data";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Digested Data";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Encrypted Data";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Data with Attributes";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Encrypted Private Key Info";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Email Address";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Unstructured Name";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Content Type";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Message Digest";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Signing Time";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Countersignature";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Challenge Password";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Unstructured Address";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Extended Certificate Attributes";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Issuer and Serial Number";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Password Check";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Public Key";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Signing Description";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Extension Request";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "S/MIME Capabilities";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Prefer Signed Data";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Cannot Decrypt Any";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Receipt Request";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Receipt";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Content Hints";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Mail List Expansion History";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME Modules";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Cryptographic Message Syntax";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Enhanced Security Services";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "S/MIME Object Identifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 Message";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS Electronic Signature 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS Electronic Signature 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS Electronic Signature Policy 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS Electronic Signature Policy 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "S/MIME Content Types";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "S/MIME Authenticated Attributes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "S/MIME Algorithms";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "S/MIME Certificate Distribution";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "LDAP Certificate Distribution";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "S/MIME Signature Policy Qualifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "S/MIME Signature Type Identifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Originator Signature";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Domain Signature";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Additional Attributes Signature";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Review Signature";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "S/MIME Capabilities";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Prefer Binary Inside";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Friendly Name (for PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Local Key ID (for PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Certificate Types (for PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509 Certificate (for PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "SDSI Certificate (for PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "CRL Types (for PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (for PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 Personal Information Exchange Syntax";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 Password-Based Encryption IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE with SHA-1 and 128-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE with SHA-1 and 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE with SHA-1 and 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE with SHA-1 and 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE with SHA-1 and 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE with SHA-1 and 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 Key Shrouding";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 Bag IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 Key Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 Certificate and CRL Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 Secret Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 Safe Contents ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 Shrouded Key Bag ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 Certificate Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 Certificate and CRL Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI Certificate Bag ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 Password-Based Encryption ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE with SHA-1 and 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE with SHA-1 and 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE with SHA-1 and Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE with SHA-1 and 128-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE with SHA-1 and 40-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE with SHA-1 and RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE with SHA-1 and RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 Enveloping IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA Encryption with 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA Encryption with 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA Encryption with Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "PKCS-12 Signature ID";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA Signature with SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Version 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 Bag IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 Key Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 Shrouded Key Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 Certificate Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 Secret Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 Safe Contents Bag";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "PKCS-15 Modules";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "PKCS-15 Attributes";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "PKCS-15 Content Type";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "PKCS-15 Content";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "RSADSI Digest Algorithm";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC with SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "RSADSI Encryption Algorithm";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 with MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus unknown policy identifier";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server object class";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Site-Addressing";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Class Schema";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Attribute Schema";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Mailbox-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Mailbox";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Container";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Mail Recipient";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Delivery Mechanism";

"06 07 2A 86 48 86 F7 14 04"				= "Microsoft file formats";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "SPC Indirect Data Context";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "SPC Agency Info";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "SPC Statement Type";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC Opus Info";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "SPC Certificate Extensions";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "SPC PE lmage Data";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC Link (type 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Individual Code Signing";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Commercial Code Signing";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC Link (type 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "SPC Minimal Criteria";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "SPC Financial Criteria";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC Link (type 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "NTLM Security Support Provider";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Time Stamp Countersignature";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Certificate Trust List";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Sorted CTL Extension";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Next Update Location";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Enhanced Key Usage";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Certificate Trust List Signing";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Time Stamp Signing";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Serialized Encryption";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Encrypted File Systems";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Encrypted File Systems Recovery";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows Hardware Compatible";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "NT5 Signing";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Windows Hardware OEM Signing";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Embedded NT Signing";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Trusted Root List Signing";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Qualified Subordination";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Key Recovery";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Document Signing";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Attribute Object Identifiers";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Yes/No Trust Attribute";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM Individualization";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Microsoft Licenses";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft License Server";

"06 08 2B 06 01 04 01 82 37 0D"				= "Microsoft PKCS-10 Object Identifiers";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Renewal Certificate";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Enrollment Name/Value Pair";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Enrollment CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "OS Version";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Microsoft PKCS-12 Attributes";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Local Machine Keyset";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft Enrollment Infrastructure";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Auto-Enroll CTL Usage";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Enrollment Certificate Type";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Enrollment Agent";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartcard Logon";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "NT Principal Name";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft Certificate Server Infrastructure";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA Renewal Version";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "CAPICOM Version";
"06 09 2B 06 01 04 01 82 37 58 02"			= "CAPICOM Attribute";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Document Name";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Document Description";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Encrypted Data";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Encrypted Content";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "UNINETT Policy Identifier";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ICE-TEL Policy Identifier";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ICE-TEL CA Policy Identifier";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal with SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal with RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "cryptlib Attributes";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "cryptlib Presence Check";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP Response RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP Response RTCS Extended";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "CRL Extended Reason";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Key Features";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "cryptlib Content";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "cryptlib Configuration Data";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "cryptlib User Index";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "cryptlib User Info";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "XYZZY Policy Identifier";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Time Signature System";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Time Signature System 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Time Signature System 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Time Signature System 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Secondary Practices";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Physician Identifiers";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Kerberos Authentication Data";
"06 07 2B 06 01 05 02 03 02"        = "Kerberos Diffie-Hellman Key Data";
"06 07 2B 06 01 05 02 03 03"        = "Kerberos Reply Key Data";
"06 07 2B 06 01 05 02 03 04"        = "Kerberos Client Authentication";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos Key Distribution Center (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Simple Public Key Mechanism (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Public Key Infrastructure";

"06 07 2B 06 01 05 05 07 01"		= "PKIX Private Certificate Extensions";
"06 08 2B 06 01 05 05 07 01 01"		= "Certificate Authority Information Access";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometric Information";
"06 08 2B 06 01 05 05 07 01 03"		= "Qualified Certificate Statements";
"06 08 2B 06 01 05 05 07 01 04"		= "Attribute Certificate Audit Identity";
"06 08 2B 06 01 05 05 07 01 05"		= "Attribute Certificate Targeting";
"06 08 2B 06 01 05 05 07 01 06"		= "Attribute Certificate Authority Controls";
"06 08 2B 06 01 05 05 07 01 07"		= "SBGP IP Address Block";
"06 08 2B 06 01 05 05 07 01 08"		= "SBGP Autonomous System Identifier";
"06 08 2B 06 01 05 05 07 01 09"		= "SBGP Router Identifier";
"06 08 2B 06 01 05 05 07 01 0A"		= "Attribute Certificate Proxying";
"06 08 2B 06 01 05 05 07 01 0B"		= "Subject Information Access";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Policy Qualifier Types";
"06 08 2B 06 01 05 05 07 02 01"		= "Certification Practice Statement";
"06 08 2B 06 01 05 05 07 02 02"		= "User Notice";
"06 08 2B 06 01 05 05 07 02 03"		= "Text Notice";

"06 07 2B 06 01 05 05 07 03"		= "Key Purpose";
"06 08 2B 06 01 05 05 07 03 01"		= "Server Authentication";
"06 08 2B 06 01 05 05 07 03 02"		= "Client Authentication";
"06 08 2B 06 01 05 05 07 03 03"		= "Code Signing";
"06 08 2B 06 01 05 05 07 03 04"		= "Email Protection";
"06 08 2B 06 01 05 05 07 03 05"		= "IPSEC End System";
"06 08 2B 06 01 05 05 07 03 06"		= "IPSEC Tunnel";
"06 08 2B 06 01 05 05 07 03 07"		= "IPSEC User";
"06 08 2B 06 01 05 05 07 03 08"		= "Time Stamping";
"06 08 2B 06 01 05 05 07 03 09"		= "OCSP Signing";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "SBGP AA Server Authentication";

"06 07 2B 06 01 05 05 07 04"		= "CMP Information Types";
"06 08 2B 06 01 05 05 07 04 01"		= "CA Protocol Encryption Certificate";
"06 08 2B 06 01 05 05 07 04 02"		= "Signing Key Pair Types";
"06 08 2B 06 01 05 05 07 04 03"		= "Encryption Key Pair Types";
"06 08 2B 06 01 05 05 07 04 04"		= "Preferred Symmetric Algorithm";
"06 08 2B 06 01 05 05 07 04 05"		= "CA Key Update Info";
"06 08 2B 06 01 05 05 07 04 06"		= "Current CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Unsupported OIDs";
"06 08 2B 06 01 05 05 07 04 08"		= "Subscription Request";
"06 08 2B 06 01 05 05 07 04 09"		= "Subscription Response";
"06 08 2B 06 01 05 05 07 04 0A"		= "Key Pair Parameter Request";
"06 08 2B 06 01 05 05 07 04 0B"		= "Key Pair Parameter Response";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "CRMF Registration";
"06 08 2B 06 01 05 05 07 05 01"		= "Registration Control";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Registration Token";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Authenticator";
"06 09 2B 06 01 05 05 07 05 01 03"	= "PKI Publication Info";
"06 09 2B 06 01 05 05 07 05 01 04"	= "PKI Archive Options";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Old Certificate ID";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Protocol Encryption Key";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alternate Certificate Template";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS Template";

"06 08 2B 06 01 05 05 07 05 02"		= "CRMF Registration Info";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 Pairs";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Certificate Request";

"06 07 2B 06 01 05 05 07 06"		= "Algorithms";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "No Signature";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "CMC Controls";

"06 07 2B 06 01 05 05 07 08"		= "Other Names";
"06 08 2B 06 01 05 05 07 08 01"		= "Personal Data";
"06 08 2B 06 01 05 05 07 08 02"		= "User Group";

"06 07 2B 06 01 05 05 07 09"		= "Personal Data";
"06 08 2B 06 01 05 05 07 09 01"		= "Date of Birth";
"06 08 2B 06 01 05 05 07 09 02"		= "Place of Birth";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonym";
"06 08 2B 06 01 05 05 07 09 04"		= "Gender";
"06 08 2B 06 01 05 05 07 09 05"		= "Country of Citizenship";
"06 08 2B 06 01 05 05 07 09 06"		= "Country of Residence";

"06 07 2B 06 01 05 05 07 0A"		= "Attribute Certificate";
"06 08 2B 06 01 05 05 07 0A 01"		= "Authentication Information";
"06 08 2B 06 01 05 05 07 0A 02"		= "Access Identity";
"06 08 2B 06 01 05 05 07 0A 03"		= "Charging Identity";
"06 08 2B 06 01 05 05 07 0A 04"		= "Group";
"06 08 2B 06 01 05 05 07 0A 05"		= "Role";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Online Certificate Status Protocol";
"06 09 2B 06 01 05 05 07 30 01 01"	= "OCSP Basic Response";
"06 09 2B 06 01 05 05 07 30 01 02"	= "OCSP Nonce Extension";
"06 09 2B 06 01 05 05 07 30 01 03"	= "OCSP CRL Reference";
"06 09 2B 06 01 05 05 07 30 01 04"	= "OCSP Response";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP No Revocation Check";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP Archive Cutoff";
"06 09 2B 06 01 05 05 07 30 01 07"	= "OCSP Service Locator";

"06 08 2B 06 01 05 05 07 30 02"		= "CA Issuers";
"06 08 2B 06 01 05 05 07 30 03"		= "Time Stamping";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Intermediate";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "DEC Encryption Algorithm";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "DEC Hash Algorithm";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "DEC Signature Algorithm";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 with RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 with RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 with RSA";
"06 05 2B 0E 03 02 03"				= "MD5 with RSA";
"06 05 2B 0E 03 02 04"				= "MD4 with RSA Encryption";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N with RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "RSA Signature";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA with SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 with RSA Signature";
"06 05 2B 0E 03 02 0F"				= "SHA with RSA Signature";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman with Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "DSA Common with SHA";
"06 05 2B 0E 03 02 16"				= "RSA Key Transport";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 with RSA Signature";
"06 05 2B 0E 03 02 19"				= "MD5 with RSA Signature";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA with SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA with Common SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 with RSA Encryption";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 with RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 with ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Document";
"06 04 2B 24 01 01"					= "Final Version";
"06 04 2B 24 01 02"					= "Draft";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algorithm";
"06 04 2B 24 03 01"					= "Encryption Algorithm";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA Encryption";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hash Algorithm";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 Single Length";
"06 05 2B 24 03 02 05"				= "MDC2 Double Length";
"06 04 2B 24 03 03"					= "Signature Algorithm";
"06 05 2B 24 03 03 01"				= "RSA Signature";

"06 06 2B 24 03 03 01 01"			= "RSA Signature with SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "RSA Signature with SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "RSA Signature with SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "RSA Signature with SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "RSA Signature with SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "RSA Signature with SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "RSA Signature with SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "RSA Signature with SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "RSA Signature with SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "RSA Signature with SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "RSA Signature with SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "RSA Signature with SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "RSA Signature with SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "RSA Signature with SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "RSA Signature with SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "RSA Signature with SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "RSA Signature with SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "RSA Signature with SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "RSA Signature with SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "RSA Signature with SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "RSA Signature with SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "RSA Signature with SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "RSA Signature with SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "RSA Signature with SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "RSA Signature with SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "RSA Signature with SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "RSA Signature with RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "RSA Signature with RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "RSA Signature with RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "RSA Signature with RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "RSA Signature with RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "RSA Signature with RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "RSA Signature with RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "RSA Signature with RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "RSA Signature with RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "RSA Signature with RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "RSA Signature with RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "RSA Signature with RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "RSA Signature with RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "RSA Signature with RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "RSA Signature with RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "RSA Signature with RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "RSA Signature with RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "RSA Signature with RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "RSA Signature with RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "RSA Signature with RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "RSA Signature with RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "RSA Signature with RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "RSA Signature with RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "RSA Signature with RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "RSA Signature with RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "RSA Signature with RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "RSA Signature with RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "RSA Signature with RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ECSIE Signature";
"06 06 2B 24 03 03 02 01"			= "ECSIE Signature with SHA-1";
"06 06 2B 24 03 03 02 02"			= "ECSIE Signature with RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ECSIE Signature with MD2";
"06 06 2B 24 03 03 02 04"			= "ECSIE Signature with MD5";

"06 04 2B 24 03 04"					= "Signature Scheme";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 with RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 with RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 with RND";

"06 03 2B 24 04"					= "Attribute";
"06 03 2B 24 05"					= "Policy";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Manufacturer-Specific API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Functionality-Specific API";
"06 03 2B 24 07"					= "Key Management";
"06 04 2B 24 07 01"					= "Key Agreement";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Key Transfer";
"06 05 2B 24 07 02 01"				= "ISO9796-2 with RSA Encryption";

"06 05 2B 24 08 01 01"				= "Teletrust SigiSigConform Policy Identifier";
"06 05 2B 24 08 02 01"				= "Directory Service";

"06 05 2B 24 08 03 01"				= "Date of Certificate Generation";
"06 05 2B 24 08 03 02"				= "Procuration";
"06 05 2B 24 08 03 03"				= "Admission";
"06 05 2B 24 08 03 04"				= "Monetary Limit";
"06 05 2B 24 08 03 05"				= "Declaration of Majority";
"06 05 2B 24 08 03 06"				= "Integrated Circuit Card Serial Number";
"06 05 2B 24 08 03 07"				= "Public Key Reference";
"06 05 2B 24 08 03 08"				= "Restriction";
"06 05 2B 24 08 03 09"				= "Retrieve If Allowed";
"06 05 2B 24 08 03 0A"				= "Requested Certificate";
"06 05 2B 24 08 03 0B"				= "Naming Authorities";
"06 05 2B 24 08 03 0C"				= "Certificate In Directory Since";
"06 05 2B 24 08 03 0D"				= "Certificate Hash";

"06 05 2B 24 08 04 01"				= "Personal Data";
"06 05 2B 24 08 04 08"				= "Restriction";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA with SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA with RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Extended";
"06 07 2B 24 08 05 01 02 02"		= "DSA with RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certificate";
"06 05 2B 24 08 06 02"				= "Certificate Reference";
"06 05 2B 24 08 06 03"				= "Attribute Certificate";
"06 05 2B 24 08 06 04"				= "Attribute Reference";
"06 05 2B 24 08 06 05"				= "File Name";
"06 05 2B 24 08 06 06"				= "Storage Time";
"06 05 2B 24 08 06 07"				= "File Size";
"06 05 2B 24 08 06 08"				= "Location";
"06 05 2B 24 08 06 09"				= "Signature Number";
"06 05 2B 24 08 06 0A"				= "Autogenerated";

"06 05 2B 24 08 07 01"				= "Teletrust Presentation Types";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binary";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Text";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Thawte Certificate Extension";
"06 05 2B 65 01 04 01"				= "Strong Extranet";

/* X.520 */

"06 02 55 04"		= "X.520 Attribute Types";
"06 03 55 04 00"	= "Object Class";
"06 03 55 04 01"	= "Aliased Entry Name";
"06 03 55 04 02"	= "Knowledge Information";
"06 03 55 04 03"	= "Common Name";
"06 03 55 04 04"	= "Surname";
"06 03 55 04 05"	= "Serial Number";
"06 03 55 04 06"	= "Country Name";
"06 03 55 04 07"	= "Locality Name";
"06 04 55 04 07 01"	= "Collective Locality Name";
"06 03 55 04 08"	= "State or Province Name";
"06 04 55 04 08 01"	= "Collective State or Province Name";
"06 03 55 04 09"	= "Street Address";
"06 04 55 04 09 01"	= "Collective Street Address";
"06 03 55 04 0A"	= "Organization Name";
"06 04 55 04 0A 01"	= "Collective Organization Name";
"06 03 55 04 0B"	= "Organizational Unit Name";
"06 04 55 04 0B 01"	= "Collective Organizational Unit Name";
"06 03 55 04 0C"	= "Title";
"06 03 55 04 0D"	= "Description";
"06 03 55 04 0E"	= "Search Guide";
"06 03 55 04 0F"	= "Business Category";
"06 03 55 04 10"	= "Postal Address";
"06 04 55 04 10 01"	= "Collective Postal Address";
"06 03 55 04 11"	= "Postal Code";
"06 04 55 04 11 01"	= "Collective Postal Code";
"06 03 55 04 12"	= "Post Office Box";
"06 04 55 04 12 01"	= "Collective Post Office Box";
"06 03 55 04 13"	= "Physical Delivery Office Name";
"06 04 55 04 13 01"	= "Collective Physical Delivery Office Name";
"06 03 55 04 14"	= "Telephone Number";
"06 04 55 04 14 01"	= "Collective Telephone Number";
"06 03 55 04 15"	= "Telex Number";
"06 04 55 04 15 01"	= "Collective Telex Number";
"06 03 55 04 16"	= "Teletex Terminal Identifier";
"06 04 55 04 16 01"	= "Collective Teletex Terminal Identifier";
"06 03 55 04 17"	= "Facsimile Telephone Number";
"06 04 55 04 17 01"	= "Collective Facsimile Telephone Number";
"06 03 55 04 18"	= "X.121 Address";
"06 03 55 04 19"	= "International ISDN Number";
"06 04 55 04 19 01"	= "Collective International ISDN Number";
"06 03 55 04 1A"	= "Registered Address";
"06 03 55 04 1B"	= "Destination Indicator";
"06 03 55 04 1C"	= "Preferred Delivery Method";
"06 03 55 04 1D"	= "Presentation Address";
"06 03 55 04 1E"	= "Supported Application Context";
"06 03 55 04 1F"	= "Member";
"06 03 55 04 20"	= "Owner";
"06 03 55 04 21"	= "Role Occupant";
"06 03 55 04 22"	= "See Also";
"06 03 55 04 23"	= "User Password";
"06 03 55 04 24"	= "User Certificate";
"06 03 55 04 25"	= "CA Certificate";
"06 03 55 04 26"	= "Authority Revocation List";
"06 03 55 04 27"	= "Certificate Revocation List";
"06 03 55 04 28"	= "Cross Certificate Pair";
"06 03 55 04 29"	= "Name";
"06 03 55 04 2A"	= "Given Name";
"06 03 55 04 2B"	= "Initials";
"06 03 55 04 2C"	= "Generation Qualifier";
"06 03 55 04 2D"	= "Unique Identifier";
"06 03 55 04 2E"	= "DN Qualifier";
"06 03 55 04 2F"	= "Enhanced Search Guide";
"06 03 55 04 30"	= "Protocol Information";
"06 03 55 04 31"	= "Distinguished Name";
"06 03 55 04 32"	= "Unique Member";
"06 03 55 04 33"	= "House Identifier";
"06 03 55 04 34"	= "Supported Algorithms";
"06 03 55 04 35"	= "Delta Revocation List";
"06 03 55 04 36"	= "Clearance";
"06 03 55 04 3A"	= "Cross Certificate Pair";

/* X.500 object classes */

"06 02 55 06"		= "X.520 Object Class";
"06 03 55 06 00"	= "Top";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Country";
"06 03 55 06 03"	= "Locality";
"06 03 55 06 04"	= "Organization";
"06 03 55 06 05"	= "Organizational Unit";
"06 03 55 06 06"	= "Person";
"06 03 55 06 07"	= "Organizational Person";
"06 03 55 06 08"	= "Organizational Role";
"06 03 55 06 09"	= "Group of Names";
"06 03 55 06 0A"	= "Residential Person";
"06 03 55 06 0B"	= "Application Process";
"06 03 55 06 0C"	= "Application Entity";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Device";
"06 03 55 06 0F"	= "Strong Authentication User";
"06 03 55 06 10"	= "Certificate Authority";
"06 03 55 06 11"	= "Group of Unique Names";
"06 03 55 06 15"	= "PKI User";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "X.500 Algorithms";
"06 03 55 08 01"	= "X.500 Encryption Algorithms";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "X.509 Certificate Extensions";
"06 03 55 1D 01"	= "Authority Key Identifier (old)";
"06 03 55 1D 02"	= "Primary Key Attributes (old)";
"06 03 55 1D 03"	= "Certificate Policies (old)";
"06 03 55 1D 04"	= "Key Usage Restriction (old)";
"06 03 55 1D 05"	= "Policy Mapping (old)";
"06 03 55 1D 06"	= "Subtrees Constraint";
"06 03 55 1D 07"	= "Subject Alternative Name (old)";
"06 03 55 1D 08"	= "Issuer Alternative Name (old)";
"06 03 55 1D 09"	= "Subject Directory Attributes";
"06 03 55 1D 0A"	= "Basic Constraints (old 2.5.29.10)";
"06 03 55 1D 0B"	= "Name Constraints (old)";
"06 03 55 1D 0C"	= "Policy Constraints (old)";
"06 03 55 1D 0D"	= "Basic Constraints (old 2.5.29.13)";
"06 03 55 1D 0E"	= "Subject Key Identifier";
"06 03 55 1D 0F"	= "Key Usage";
"06 03 55 1D 10"	= "Private Key Usage Period";
"06 03 55 1D 11"	= "Subject Alternative Name";
"06 03 55 1D 12"	= "Issuer Alternative Name";
"06 03 55 1D 13"	= "Basic Constraints";
"06 03 55 1D 14"	= "Certificate Revocation List Number";
"06 03 55 1D 15"	= "CRL Reason Code";
"06 03 55 1D 16"	= "Expiration Date (old)";
"06 03 55 1D 17"	= "Hold Instruction Code";
"06 03 55 1D 18"	= "Invalidity Date";
"06 03 55 1D 19"	= "CRL Distribution Points (old)";
"06 03 55 1D 1A"	= "Issuing Distribution Point (old)";
"06 03 55 1D 1B"	= "Delta CRL Indicator";
"06 03 55 1D 1C"	= "Issuing Distribution Point";
"06 03 55 1D 1D"	= "Certificate Issuer";
"06 03 55 1D 1E"	= "Name Constraints";
"06 03 55 1D 1F"	= "CRL Distribution Points";
"06 03 55 1D 20"	= "Certificate Policies";
"06 04 55 1D 20 00"	= "Any Policy Identifier";
"06 03 55 1D 21"	= "Policy Mappings";
"06 03 55 1D 22"	= "Policy Constraints";
"06 03 55 1D 23"	= "Authority Key Identifier";
"06 03 55 1D 24"	= "Policy Constraints";
"06 03 55 1D 25"	= "Extended Key Usage";
"06 04 55 1D 25 00"	= "Any Extended Key Usage";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "SDNS Signature Algorithm";
"06 09 60 86 48 01 65 02 01 01 02"	= "Fortezza Signature Algorithm";
"06 09 60 86 48 01 65 02 01 01 03"	= "SDNS Confidentiality Algorithm";
"06 09 60 86 48 01 65 02 01 01 04"	= "Fortezza Confidentiality Algorithm";
"06 09 60 86 48 01 65 02 01 01 05"	= "SDNS Integrity Algorithm";
"06 09 60 86 48 01 65 02 01 01 06"	= "Fortezza Integrity Algorithm";
"06 09 60 86 48 01 65 02 01 01 07"	= "SDNS Token Protection Algorithm";
"06 09 60 86 48 01 65 02 01 01 08"	= "Fortezza Token Protection Algorithm";
"06 09 60 86 48 01 65 02 01 01 09"	= "SDNS Key Management Algorithm";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Fortezza Key Management Algorithm";
"06 09 60 86 48 01 65 02 01 01 0B"	= "SDNS Key Management and Signature Algorithm";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Fortezza Key Management and Signature Algorithm";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Suite A Signature Algorithm";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Suite A Confidentiality Algorithm";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Suite A Integrity Algorithm";
"06 09 60 86 48 01 65 02 01 01 10"	= "Suite A Token Protection Algorithm";
"06 09 60 86 48 01 65 02 01 01 11"	= "Suite A Key Management Algorithm";
"06 09 60 86 48 01 65 02 01 01 12"	= "Suite A Key Management and Signature Algorithm";
"06 09 60 86 48 01 65 02 01 01 13"	= "Fortezza Updated Signature Algorithm";
"06 09 60 86 48 01 65 02 01 01 14"	= "Fortezza Key Management and Updated Signature Algorithms";
"06 09 60 86 48 01 65 02 01 01 15"	= "Fortezza Updated Integrity Algorithm";
"06 09 60 86 48 01 65 02 01 01 16"	= "Key Exchange Algorithm";
"06 09 60 86 48 01 65 02 01 01 17"	= "Fortezza Wrap80 Algorithm";
"06 09 60 86 48 01 65 02 01 01 18"	= "Key Encryption Algorithm (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 Message Format";
"06 09 60 86 48 01 65 02 01 02 02"	= "Empty Content";
"06 09 60 86 48 01 65 02 01 02 03"	= "CSP Content Type";
"06 09 60 86 48 01 65 02 01 02 2A"	= "MSP Rev 3 Content Type";
"06 09 60 86 48 01 65 02 01 02 30"	= "MSP Content Type";
"06 09 60 86 48 01 65 02 01 02 31"	= "MSP Rekey Agent Protocol";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "MSP Rev 3.1 Content Type";
"06 09 60 86 48 01 65 02 01 02 48"	= "Forwarded MSP Message Body Part";
"06 09 60 86 48 01 65 02 01 02 49"	= "MSP Forwarded Message Parameters";
"06 09 60 86 48 01 65 02 01 02 50"	= "Forwarded CSP Message Body Part";
"06 09 60 86 48 01 65 02 01 02 51"	= "CSP Forwarded Message Parameters";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "SDNS Security Policy";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Security Policy";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Generic";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Default Security Policy";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "SDNS Key Management Certificate";
"06 09 60 86 48 01 65 02 01 05 02"	= "SDNS User Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 03"	= "SDNS Key Management and Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 04"	= "Fortezza Key Management Certificate";
"06 09 60 86 48 01 65 02 01 05 05"	= "Fortezza Key Management and Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 06"	= "Fortezza User Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 07"	= "Fortezza CA Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 08"	= "SDNS CA Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Auxiliary Vector";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Receipt Policy";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Membership";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Administrators";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS Signature CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS Signature CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "SDNS Certificate Revocation List";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Fortezza Certificate Revocation List";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Exempted Address Processor";
"06 09 60 86 48 01 65 02 01 05 30"	= "Guard";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algorithms Supported";
"06 09 60 86 48 01 65 02 01 05 32"	= "Suite A Key Management Certificate";
"06 09 60 86 48 01 65 02 01 05 33"	= "Suite A Key Management and Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 34"	= "Suite A User Signature Certificate";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC Info";
"06 09 60 86 48 01 65 02 01 05 36"	= "PRBAC CA Constraints";
"06 09 60 86 48 01 65 02 01 05 37"	= "Signature or Key Management Privileges";
"06 09 60 86 48 01 65 02 01 05 38"	= "Comm Privileges";
"06 09 60 86 48 01 65 02 01 05 39"	= "Labeled Attribute";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Policy Information File";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Sec Policy Information File";
"06 09 60 86 48 01 65 02 01 05 3C"	= "CA Clearance Constraint";

"06 09 60 86 48 01 65 02 01 07 01"		= "CSP Extensions";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ISSI Security Categories";
"06 09 60 86 48 01 65 02 01 08 02"		= "Standard Security Label Privileges";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Signature Privileges";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Key Management Privileges";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Named Tag Set Privilege";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "US Department of Defense Class 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "US Department of Defense Class 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "US Department of Defense Class 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "US Department of Defense Class 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "US Department of Defense PKI Class 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Test Security Policy";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Tag Set Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 Tag Set One";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 Tag Set Two";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 Security Categories";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 Tag Set Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 Tag Set One";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 Tag Set Two";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kafka Security Categories";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka Tag Set Name 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka Tag Set Name 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka Tag Set Name 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Test CRL Entry";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Label";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "GAK Policy Identifier";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "FBCA Rudimentary Policy Identifier";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "FBCA Basic Policy Identifier";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "FBCA Medium Policy Identifier";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "FBCA High Policy Identifier";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "KRA Key";
"06 08 60 86 48 01 65 03 02 03"			= "Extensions";
"06 09 60 86 48 01 65 03 02 03 01"		= "Key Recovery Technique";
"06 09 60 86 48 01 65 03 02 03 02"		= "Key Recovery Capable";
"06 09 60 86 48 01 65 03 02 03 03"		= "Key Recovery";
"06 08 60 86 48 01 65 03 02 04"			= "Key Recovery Schemes";
"06 08 60 86 48 01 65 03 02 05"			= "CSOR GAK Extension";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "NIST Algorithm";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Novell Algorithm";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 with RSA Encryption BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 with RSA Encryption BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 with RSA Encryption BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC with SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC with MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 Packet";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA Encryption BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "NW Password";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "PKI Attribute Type";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Security Attributes";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Reliance Limit";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Netscape Object Identifier";
"06 08 60 86 48 01 86 F8 42 01"		= "Netscape Certificate Extension";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Netscape Certificate Type";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape Base URL";
"06 09 60 86 48 01 86 F8 42 01 03"	= "Netscape Revocation URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "Netscape CA Revocation URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL Download URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "Netscape CA Certificate Download URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "Netscape Certificate Renewal URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "Netscape CA Policy URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "Netscape Certificate Homepage URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Netscape Certificate Entity Logo";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Netscape Certificate User Picture";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Netscape SSL Server Name";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Netscape Certificate Comment";

"06 08 60 86 48 01 86 F8 42 02"		= "Netscape Data Type";
"06 09 60 86 48 01 86 F8 42 02 01"	= "image/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "image/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Netscape Certificate Sequence";
"06 09 60 86 48 01 86 F8 42 02 06"	= "Netscape Certificate URL";

"06 08 60 86 48 01 86 F8 42 03"			= "Netscape Directory Object Identifier";
"06 09 60 86 48 01 86 F8 42 03 01"		= "LDAP Definitions";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Car License";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Department Number";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Employee Number";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Employee Type";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Intranet Organizational Person";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Unknown Verisign VPN extension";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Unknown Verisign VPN extension";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Verisign Policy Identifier";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 Notice";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Content Type";
"06 04 67 2A 00 00"	= "PAN Data";
"06 04 67 2A 00 01"	= "PAN Token";
"06 04 67 2A 00 02"	= "PAN Only";

"06 03 67 2A 01"	= "Message Extension";
"06 03 67 2A 02"	= "Field";
"06 04 67 2A 02 00"	= "Full Name";
"06 04 67 2A 02 01"	= "Given Name";
"06 04 67 2A 02 02"	= "Family Name";
"06 04 67 2A 02 03"	= "Birth Family Name";
"06 04 67 2A 02 04"	= "Place Name";
"06 04 67 2A 02 05"	= "Identification Number";
"06 04 67 2A 02 06"	= "Month";
"06 04 67 2A 02 07"	= "Date";
"06 04 67 2A 02 08"	= "Address";
"06 04 67 2A 02 09"	= "Telephone";
"06 04 67 2A 02 0A"	= "Amount";
"06 04 67 2A 02 0B"	= "Account Number";
"06 04 67 2A 02 0C"	= "Passphrase";

"06 03 67 2A 03"		= "Attribute";
"06 04 67 2A 03 00"		= "Certificate";
"06 05 67 2A 03 00 00"	= "Root Key Thumbprint";
"06 05 67 2A 03 00 01"	= "Additional Policy";

"06 03 67 2A 04"	= "Algorithm";
"06 03 67 2A 05"	= "Policy";
"06 04 67 2A 05 00"	= "Root";
"06 03 67 2A 06"	= "Module";
"06 03 67 2A 07"	= "Certificate Extension";
"06 04 67 2A 07 00"	= "Hashed Root Key";
"06 04 67 2A 07 01"	= "Certificate Type";
"06 04 67 2A 07 02"	= "Merchant Data";
"06 04 67 2A 07 03"	= "Card Cert Required";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "SET Extensions";
"06 04 67 2A 07 06"	= "SET Qualifier";

"06 03 67 2A 08"	= "Brand";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Vendor";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "National";
"06 05 67 2A 0A E2 00"	= "Japan";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Hashed Root Key";
"06 04 86 8D 6F 03"	= "Certificate Type";
"06 04 86 8D 6F 04"	= "Merchant Data";
"06 04 86 8D 6F 05"	= "Card Certificate Required";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "SET Qualifier";
"06 04 86 8D 6F 63"	= "SET Data";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Apple Data Security";

"06 08 2A 86 48 86 F7 63 64 01" = "Apple Trust Policy Identifier";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Apple iSign Policy";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Apple X.509 Basic Policy";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Apple SSL Policy";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Apple Local Certificate Generation Policy";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Apple Local CSR Generation Policy";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Apple CRL Revocation Policy";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Apple OCSP Revocation Policy";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Apple S/MIME Policy";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Apple Extensible Authentication Policy";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Apple Software Update Signing Policy";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Apple IPsec Policy";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Apple iChat Policy";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Apple Resource Signing Policy";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Apple Kerberos Client Policy";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Apple Kerberos Server Policy";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Apple Code Signing Policy";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Apple Package Signing Policy";

"06 08 2A 86 48 86 F7 63 64 02" = "Apple Security Algorithm Identifier";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Fast Elliptic Encryption (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple Secure Compression (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE with MD5 Signature";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE with SHA-1 Signature";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED Encryption";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (Experimental)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE with ECDSA Signature";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac Certificate Identifier";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac Certificate Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac Identity Cert Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac Email Signing Cert Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac Email Encryption Cert Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac Archive List Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac Archive Store Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac Archive Fetch Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac Archive Remove Request";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac Certificate Extension";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac Identity";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac Email Signing";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Apple .Mac Email Encryption";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac Certificate Request Value";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "User Name";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Password";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Host Name";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Renew Flag";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynchronous Flag";

"06 08 2A 86 48 86 F7 63 64 04" = "Apple Extended Key Usage";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Apple Code Signing";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Apple Code Signing (Development)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Apple Software Update Signing";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Apple Code Signing (Reserved)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Apple Resource Signing";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Apple iChat Signing";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat Encryption";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Apple System Identity";

"06 08 2A 86 48 86 F7 63 64 05" = "Apple Certificate Policies";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Apple Certificate Policy";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac Certificate Policy";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Code Signing";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Intel CDSA Security";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Intel CDSA Security Formats";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "X.509v3 Certificate Extensions";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "X.509v3 Private Certificate Extensions";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Subject Signature Bitmap";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Subject Picture";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Subject Email Address";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Use Exemptions";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Intel CDSA Security Algorithms";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 with ECDSA";

/* end */
